The  CustomExporter  type exposes the following members.
 Constructors
Name  |   Description
CustomExporter
 Constructs a new instance of a CustomExporter for a given document using the input instance of IExportContext as the output device.
 Methods
Name  |   Description
Dispose
 Releases all resources used by the  CustomExporter
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
Export(IList ElementId )
 Exports a collection of 3-D views
Export(View3D)
 Exports one 3-D view
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
IsRenderingSupported
 Checks if 3D view rendering is currently supported in the running instance of Revit.
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 Properties
Name  |   Description
IncludeFaces   |     Obsolete.
 This flag sets the exporter to either include or exclude notifications about faces being processed in the export context.
IncludeGeometricObjects
 This flag sets the exporter to either include or exclude output of geometric objects such as faces and curves when the model is being processed by the export context.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShouldStopOnError
 This flag instructs the exporting process to either stop or continue in case an error occurs during any of the exporting methods.
 See Also
  CustomExporter Class
  Autodesk.Revit.DB Namespace